[
    {
        "name":"IVC Computer Science Club",
        "slug":"ivc-csc",
        "year":"Winter 2019",
        "tech":"ReactJS, HTML5, CSS3",
        "link":"https://www.ivccsc.com",
        "git":"https://github.com/gobrien06/IVCCSCWeb",
        "demo":"https://www.youtube.com/embed/xcuoKp_6Rko",
        "image":["/images/Screen Shot 2020-02-27 at 10.52.15 PM.png", "/images/Screen Shot 2020-03-31 at 6.18.25 PM.png","/images/Screen Shot 2020-03-31 at 6.18.35 PM.png"],
        "description": "The IVC Computer Science Club website is a platform that allows new users to see important information about the club. The site gathers data from popular messaging platform Discord and displays the announcement messages dynamically, allowing new members to sign up with their emails and see important events.",
        "duties":"As the front-end engineer, I created the layout of the site with ReactJS components, and made various calls for user data through HTTP requests to our custom API.",
        "devtime":"1 Week",
        "role":"Front-end engineer. UI/UX designer.",
        "hackathon":""
    },
    {
        "name":"LifeCost",
        "slug":"lifecost",
        "year":"Spring 2020",
        "tech":"ReactJS, HTML5, CSS3",
        "image":["/images/gallery.jpg","/images/original-2.png","/images/original.png"],
        "demo":"https://www.youtube.com/embed/fx1mubmxmpA",
        "link":"https://devpost.com/software/lifecost-2pidzr",
        "git":"https://github.com/gobrien06/lifecost",
        "description": "LifeCost allows individuals to find accurate salary and cost of living information for employment in a select area. The platform scrapes through job and living information to provide accurate information for any job in any area, and displays this information in a fresh and informative way.",
        "duties":"As the front-end engineer, I created the layout of the site with ReactJS components, and made various calls for user data through HTTP requests to our custom API. I also integrated new ReactJS libraries for data visualization and animations.",
        "devtime":"36 Hours",
        "role":"Front-end engineer. UI/UX designer.",
        "hackathon":"Made for HackUCI"
    },
    {
        "name":"Hobbyist",
        "slug":"hobbyist",
        "year":"Spring 2020",
        "tech":"React Native",
        "image":["/images/Screen Shot 2020-03-31 at 12.52.23 PM.png","/images/original-3.png","/images/Screen Shot 2020-03-29 at 9.04.15 AM.png"],
        "demo":"https://www.youtube.com/embed/FPeM9PD-Mq0",
        "link":"https://devpost.com/software/hobbyist",
        "git":"https://github.com/gobrien06/hobbyist",
        "description": "Hobbyist is a mobile application that allows users to match with others within a one mile geographical radius when they both have similar interests. Hobbyist allows you to natively talk from within the app, so you don't have to exchange personal information until you've met who you've matched with. Perfect for anyone who has trouble starting that first conversation!",
        "duties":"As the front-end engineer, I created the layout of the app with React Native components, and made various calls for user data through HTTP requests to our custom API. I also integrated new React Native libraries for chat functionality and animations, and implemented the Google Maps API to display the users current location on a map.",
        "devtime":"36 Hours",
        "role":"Front-end engineer. UI/UX designer.",
        "hackathon":"Made for LAHacks"
    },
    {
        "name":"PenPals",
        "slug":"penpals",
        "year":"Spring 2020",
        "tech":"React Native",
        "image":["/images/Screen Shot 2020-04-25 at 5.08.24 PM.png","/images/Screen Shot 2020-04-25 at 5.08.52 PM.png","/images/Screen Shot 2020-04-25 at 5.08.43 PM.png" ],
        "demo":"https://www.youtube.com/embed/c7m97erSEKA",
        "link":"https://github.com/gobrien06/penpals",
        "git":"https://github.com/gobrien06/penpals",
        "description":"PenPals is a mobile application that allows users to match with far-away strangers based off their common languages. PenPals enables you to learn a variety of languages and cultures by interacting with individuals as far away from your current geolocation as possible, ensuring you'll meet a user with a different culture or experience with a language. Ever wanted to learn a new language? Get a PenPal!",
        "duties":"As the front-end engineer, I created the layout of the app with React Native components, and made various calls for user data through HTTP requests to our custom API. I also integrated new React Native libraries for chat functionality and animations, and implemented geolocation fetching to get the users current location.",
        "devtime":"48 Hours",
        "role":"Front-end engineer. UI/UX designer.",
        "hackathon":"Made for IVCHacks",
        "winner":"true"
    }
]